// Задание 1

// Текст задания
// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной в консоль
// const num = 123;
// console.log(num);

// Создайте переменную а и присвойте ей значение 5, переопределите переменную а на значение 7, выведите переменную а в консоль
// let a = 5;
// a = 7;
// console.log(a);

// Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции console.log выведите в консоль содержимое переменной b.
// const b = 1 + 2 + 3;
// console.log(b);
// Создайте 2 вида комментариев в вашем коде, добавьте в них произвольный текст

// Задание 2

// Создайте переменную c со значением 10 и переменную d со значением 2.
// const c = 10;
// const d = 2;

// // Все созданные переменные должны быть логично названы
// // Создайте переменную суммы и присвойте сумму чисел (c,d)
// let sum = c + d;
// console.log(sum);

// // Создайте переменную разности и присвойте разность чисел (c,d)
// let diff = c - d;
// console.log(diff);

// // Создайте переменную прозведения и присвойте произведение чисел (c,d)
// let multi = c * d;
// console.log(multi);

// // Создайте переменную частного и присвойте деление чисел (c,d)
// let quotient = c / d;
// console.log(quotient);

// // Выведите в консоль все созданные переменные
// // Сложите все созданные переменные и выведите результат в консоль
// let sumPer = sum + diff + multi + quotient;
// console.log(sumPer);

// Задание 3

// Создайте 2 переменные , одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год
// const userAge = 26;
// const currentYear = 2023;
// const sum = userAge + currentYear;
// const dif = currentYear - userAge;
// const mult = currentYear * userAge;
// const div = currentYear / userAge;
// console.log(`userAge = ${userAge}, currentYear, sum, dif, mult, div`);
// console.log(userAge + currentYear + sum + dif + mult + div);

// Задание 4

// Не запуская код, определите, что выведется в консоль:
// let a = 5 + 5 * 3 + 3;
// Не запуская код, определите, что выведется в консоль:
// let a = 8 / 2 + 2;
// Не запуская код, определите, что выведется в консоль:
// let a = (2 + 3) * (2 + 3);
// Не запуская код, определите, что выведется в консоль:
// let a = (2 + 3) * 2 + 3;
// Не запуская код, определите, что выведется в консоль:
// let a = (2 * 8) / 4;
// Не запуская код, определите, что выведется в консоль:
// let a = 2 * (8 / 4);

// Задание 5

// Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.
// let a = 1.5;
// let b = 0.75;
// let sum = a + b;
// console.log(sum);

// Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.
// const a = 354.523;
// console.log(Math.round(a));
// console.log(Math.floor(a));
// console.log(Math.ceil(a));
// console.log(Math.trunc(a));
// console.log(a.toFixed(2));
// console.log(a * 100);
// console.log(Math.trunc(a * 100) / 100);

// Задание 6

// Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные в консоль
// const name = "alexandr";
// const sName = "varvashenia";
// console.log(name, sName);

// Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'javascript'.
// const first = "java";
// const last = "script";
// console.log(first + last);

// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'hello world'.
// const a = "hello";
// const b = "world";
// console.log(a, b);
